In [1]:
import pandas as pd
import numpy as np

### To store one dimensional data using pandas
#### Series datastructure

In [2]:
list1 = ["A", "B", "C", "D", "E"]
series1 = pd.Series(list1, index=['a', 'b', 'c', 'd', 'e'])

In [3]:
series1

a    A
b    B
c    C
d    D
e    E
dtype: object

In [4]:
array = np.random.randint(20, 25, size=(10))

In [5]:
array

array([21, 23, 24, 22, 21, 23, 23, 22, 23, 23], dtype=int32)

In [6]:
series2 = pd.Series(array)

In [7]:
series2

0    21
1    23
2    24
3    22
4    21
5    23
6    23
7    22
8    23
9    23
dtype: int32

In [8]:
series3 = pd.Series(np.random.randint(30, 35, size=(10)))

In [9]:
series3

0    30
1    31
2    31
3    33
4    34
5    30
6    34
7    34
8    30
9    33
dtype: int32

In [10]:
series2 + series3

0    51
1    54
2    55
3    55
4    55
5    53
6    57
7    56
8    53
9    56
dtype: int32

### Dataframe

In [11]:
students = ["Student1", "Student2", "Student3", "Student4", "Student5"]
rollno = ['001', '002', '003', '004', '005']
scores = [45, 56, 54, 67, 87]

In [12]:
record = {
    "Students": students,
    "Roll No": rollno,
    "Scores": scores
}

In [13]:
record

{'Students': ['Student1', 'Student2', 'Student3', 'Student4', 'Student5'],
 'Roll No': ['001', '002', '003', '004', '005'],
 'Scores': [45, 56, 54, 67, 87]}

In [14]:
record_df = pd.DataFrame(record)

In [15]:
record_df

   Students Roll No  Scores
0  Student1     001      45
1  Student2     002      56
2  Student3     003      54
3  Student4     004      67
4  Student5     005      87

In [16]:
record_df.set_index(["Roll No"])

         Students  Scores
Roll No
001      Student1      45
002      Student2      56
003      Student3      54
004      Student4      67
005      Student5      87

In [17]:
dict1 = {
    "A": [12, 13, 45, 56, 78],
    "B": [13, 16, 18, 14, 19],
    "C": [34, 16, 23, 15, 17],
    "D": [45, 34, 23, 23, 22]
}

In [18]:
dict1

{'A': [12, 13, 45, 56, 78],
 'B': [13, 16, 18, 14, 19],
 'C': [34, 16, 23, 15, 17],
 'D': [45, 34, 23, 23, 22]}

In [19]:
df_1 = pd.DataFrame(dict1)

In [20]:
df_1

    A   B   C   D
0  12  13  34  45
1  13  16  16  34
2  45  18  23  23
3  56  14  15  23
4  78  19  17  22

#### to see the columns in the df_1

In [21]:
df_1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### Accessing the desired columns/features

In [22]:
df_1["A"]

0    12
1    13
2    45
3    56
4    78
Name: A, dtype: int64

In [23]:
df_1[["A", "B"]]

    A   B
0  12  13
1  13  16
2  45  18
3  56  14
4  78  19

In [24]:
df_1

    A   B   C   D
0  12  13  34  45
1  13  16  16  34
2  45  18  23  23
3  56  14  15  23
4  78  19  17  22

In [25]:
df_1["E"] = df_1["A"] + df_1["B"] + df_1["C"] + df_1["D"]

In [26]:
df_1

    A   B   C   D    E
0  12  13  34  45  104
1  13  16  16  34   79
2  45  18  23  23  109
3  56  14  15  23  108
4  78  19  17  22  136

In [27]:
df_1["F"] = df_1["E"]/4

In [28]:
df_1

    A   B   C   D    E      F
0  12  13  34  45  104  26.00
1  13  16  16  34   79  19.75
2  45  18  23  23  109  27.25
3  56  14  15  23  108  27.00
4  78  19  17  22  136  34.00

### info() method

In [29]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
 3   D       5 non-null      int64
 4   E       5 non-null      int64
 5   F       5 non-null      float64
dtypes: float64(1), int64(5)
memory usage: 372.0 bytes

In [30]:
dict2 = {
    "Students": ["student1", "student2", "student3", "student1", "student5", "student6", "student7"],

    "Roll no": ['005', '003', np.nan, '005', '001', '012', np.nan],

    "Gender": ["Male", "Female", "Male", "Male", np.nan, "Female", "Female"],

    "Marks_obtained": [65, 56, 78, 65, 49, np.nan, 34]
}

In [31]:
dict2

{'Students': ['student1',
  'student2',
  'student3',
  'student1',
  'student5',
  'student6',
  'student7'],
 'Roll no': ['005', '003', nan, '005', '001', '012', nan],
 'Gender': ['Male', 'Female', 'Male', 'Male', nan, 'Female', 'Female'],
 'Marks_obtained': [65, 56, 78, 65, 49, nan, 34]}

In [32]:
student_df = pd.DataFrame(dict2)

In [33]:
student_df

   Students Roll no  Gender  Marks_obtained
0  student1     005    Male            65.0
1  student2     003  Female            56.0
2  student3     NaN    Male            78.0
3  student1     005    Male            65.0
4  student5     001     NaN            49.0
5  student6     012  Female             NaN
6  student7     NaN  Female            34.0

### to check the null value

In [34]:
student_df.isnull().sum()

Students          0
Roll no           2
Gender            1
Marks_obtained    1
dtype: int64

#### to check the duplicate value in the record

In [35]:
student_df.duplicated().sum()

np.int64(1)

### Remove the duplicate value

In [36]:
student_df = student_df.drop_duplicates()

In [37]:
student_df.dropna()

   Students Roll no  Gender  Marks_obtained
0  student1     005    Male            65.0
1  student2     003  Female            56.0

### Mean and mode imputation

In [39]:
student_df

   Students Roll no  Gender  Marks_obtained
0  student1     005    Male            65.0
1  student2     003  Female            56.0
2  student3     NaN    Male            78.0
4  student5     001     NaN            49.0
5  student6     012  Female             NaN
6  student7     NaN  Female            34.0

In [43]:
gender_mode = student_df['Gender'].mode()[0]

In [44]:
gender_mode

'Female'

In [47]:
marks_mean = student_df['Marks_obtained'].mean()

In [48]:
marks_mean

np.float64(56.4)

In [49]:
student_df['Gender'] = student_df['Gender'].fillna(gender_mode)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_5936\3571077306.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student_df['Gender'] = student_df['Gender'].fillna(gender_mode)

In [50]:
student_df

   Students Roll no  Gender  Marks_obtained
0  student1     005    Male            65.0
1  student2     003  Female            56.0
2  student3     NaN    Male            78.0
4  student5     001  Female            49.0
5  student6     012  Female             NaN
6  student7     NaN  Female            34.0

### Filling marks

In [51]:
student_df['Marks_obtained'] = student_df['Marks_obtained'].fillna(marks_mean)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_5936\1016548318.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student_df['Marks_obtained'] = student_df['Marks_obtained'].fillna(marks_mean)

In [52]:
student_df

   Students Roll no  Gender  Marks_obtained
0  student1     005    Male            65.0
1  student2     003  Female            56.0
2  student3     NaN    Male            78.0
4  student5     001  Female            49.0
5  student6     012  Female            56.4
6  student7     NaN  Female            34.0

In [53]:
student_df = student_df.dropna()

In [54]:
student_df

   Students Roll no  Gender  Marks_obtained
0  student1     005    Male            65.0
1  student2     003  Female            56.0
4  student5     001  Female            49.0
5  student6     012  Female            56.4